Grasshopper.Kernel.GH_RenderArgs.#ctor(Rhino.RhinoDoc,Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMeshes.RenderMeshes,Rhino.PlugIns.PlugIn,System.Collections.Generic.Dictionary{System.Int32,Rhino.Render.RenderMaterial})
Create new render arguments.
doc: Rhino document.
vp: Viewport.
geometry: Geometry list.
plugIn: Render plugin.
materialCache: Material cache - can be Nothing.

Grasshopper.Kernel.GH_RenderArgs.Geometry
Gets the geometry primitive list to append to.